CastAway/app/controllers/admins_controller.rb

SELECT "admins".* FROM "admins"
---
  def index
    @admins = Admin.all

INSERT INTO "admins" ("username", "email", "password_digest") VALUES ($1, $2, $3) RETURNING "id"  [["username", "ash"], ["email", "ash@ash.com"], ["password_digest", "$2a$12$TcWP/HKoLn9csV5VqJLhYOGYpWh9XRhqxv0Wt8FhaMDDGvw7ClSja"]]
---
  def create
    @admin = Admin.new(admin_params)

    if @admin.save

SELECT "admins".* FROM "admins" WHERE "admins"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def set_admin
    @admin = Admin.find(params[:id])