CastAway/app/controllers/application_controller.rb

SELECT "admins".* FROM "admins" WHERE "admins"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def authorize_request
      header = request.headers['Authorization']
      header = header.split(' ').last if header
      begin
        @decoded = decode(header)
        @current_admin = Admin.find(@decoded[:admin_id])