CastAway/app/controllers/authentication_controller.rb

  def login
    @admin = Admin.find_by_username(login_params[:username])
---
SELECT "admins".* FROM "admins" WHERE "admins"."username" = $1 LIMIT $2  [["username", "ash"], ["LIMIT", 1]]