CastAway/app/controllers/patterns_controller.rb

      def index
        @patterns = Pattern.all
---
SELECT "patterns".* FROM "patterns"

      def create
        @pattern = Pattern.new(pattern_params)
        @pattern.admin = @current_admin

        if @pattern.save
---
INSERT INTO "patterns" ("name", "difficulty", "yarn", "needle_size", "gauge", "admin_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "test"], ["difficulty", "test"], ["yarn", "test"], ["needle_size", "test"], ["gauge", "test"], ["admin_id", 5]]

      def update
        if @pattern.update(pattern_params)
---
UPDATE "patterns" SET "difficulty" = $1 WHERE "patterns"."id" = $2  [["difficulty", "edit"], ["id", 4]]

      def set_pattern
        @pattern = current_admin.patterns.find(params[:id])
---
SELECT "patterns".* FROM "patterns" WHERE "patterns"."admin_id" = $1 AND "patterns"."id" = $2 LIMIT $3  [["admin_id", 5], ["id", 4], ["LIMIT", 1]]