CastAway/app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects"
---
    def index
      @projects = Project.all

INSERT INTO "projects" ("garment_type", "instruction", "admin_id", "pattern_id", "title", "image_url") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["garment_type", "carpet"], ["instruction", "please happen"], ["admin_id", 5], ["pattern_id", 2], ["title", "magic"], ["image_url", "https://i.imgur.com/V0SwlKV.png"]]
---
    def create
      @project = Project.new(project_params)
      @project.admin = @current_admin
      @project.pattern = @pattern
      if @project.save

DELETE FROM "projects" WHERE "projects"."id" = $1  [["id", 3]]
---
    def destroy
      @project.destroy

SELECT "projects".* FROM "projects" WHERE "projects"."admin_id" = $1 AND "projects"."id" = $2 LIMIT $3  [["admin_id", 5], ["id", 4], ["LIMIT", 1]]
---
    def set_project
      @project = @current_admin.projects.find(params[:id])

SELECT "patterns".* FROM "patterns" WHERE "patterns"."admin_id" = $1 AND "patterns"."id" = $2 LIMIT $3  [["admin_id", 5], ["id", 2], ["LIMIT", 1]]
---
    def set_pattern
      @pattern = @current_admin.patterns.find(params[:pattern_id])